#language: ru

@tree

Функционал: Закрытие обслуживаний

Как специалист я хочу
закрыть документ обслуживания клиента 
чтобы показать выполненную работу   

Контекст:
	Дано я подключаю профиль TestClient "Специалист Петров"

Сценарий: Закрытие документов Обслуживание клиента специалистом
	* Я перехожу в справочник "Документы"
		И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Обслуживание клиента'
	* Я закрываю первый документ "Обслуживание клиента"
		* Я открываю первый документ "Обслуживание клиента"
			Тогда открылось окно 'Обслуживание клиента'
			И в таблице "Список" я перехожу к строке:
				| 'Дата проведения работ' | 'Договор'    | 'Клиент'    | 'Специалист'  |
				| '07.01.2025'            | 'Договор №4' | 'ИП Иванов' | 'Петров М.В.' |
			И в таблице "Список" я активизирую поле с именем "Специалист"
			И в таблице "Список" я выбираю текущую строку
			Тогда открылось окно 'Обслуживание клиента * от *'
		* Я заполняю выполненые работы
			И в таблице "ВыполненныеРаботы" я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыОписаниРабот' я ввожу текст 'Выполнение основной работы'
			И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыФактическиПотраченоЧасов"
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '3'
			И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '7'
			И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
			И в таблице "ВыполненныеРаботы" я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыОписаниРабот' я ввожу текст 'Выполнение дополнительной работы'
			И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыФактическиПотраченоЧасов"
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '8'
			И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '8'
			И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
			И я нажимаю на кнопку с именем 'ФормаЗаписать'
			Тогда открылось окно 'Обслуживание клиента * от *'
		* Я загружаю чек от клиента	
			И В текущем окне я нажимаю кнопку командного интерфейса 'Присоединенные файлы'
			И я нажимаю на кнопку с именем 'ДобавитьИзФайлаНаДиске'
			И я выбираю файл 'C:\1C\Чек.jpg'
			Тогда открылось окно 'Обслуживание клиента * от *'
		* Я сохраняю документ	
			И В текущем окне я нажимаю кнопку командного интерфейса 'Основное'
			И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
			И я жду закрытия окна 'Обслуживание клиента * от *' в течение 20 секунд
			Тогда открылось окно 'Обслуживание клиента'
	* Я закрываю второй документ "Обслуживание клиента"
		* Я открываю второй документ "Обслуживание клиента"
			И в таблице "Список" я перехожу к строке:
				| 'Дата проведения работ' | 'Договор'    | 'Клиент'      | 'Специалист'  |
				| '09.01.2025'            | 'Договор №2' | 'ИП Сорокина' | 'Петров М.В.' |
			И в таблице "Список" я выбираю текущую строку
			Тогда открылось окно 'Обслуживание клиента * от *'
		* Я заполняю выполненые работы
			И в таблице "ВыполненныеРаботы" я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыОписаниРабот' я ввожу текст 'Проверка оборудования'
			И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыФактическиПотраченоЧасов"
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '3'
			И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '5'
			И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
			И в таблице "ВыполненныеРаботы" я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыОписаниРабот' я ввожу текст 'Устранение проблем'
			И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыФактическиПотраченоЧасов"
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст '4'
			И в таблице "ВыполненныеРаботы" я активизирую поле с именем "ВыполненныеРаботыЧасыКОплатеКлиенту"
			И в таблице "ВыполненныеРаботы" в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст '4'
			И в таблице "ВыполненныеРаботы" я завершаю редактирование строки
			И я нажимаю на кнопку с именем 'ФормаЗаписать'
			Тогда открылось окно 'Обслуживание клиента * от *'
		* Я загружаю чек от клиента
			И В текущем окне я нажимаю кнопку командного интерфейса 'Присоединенные файлы'
			И я нажимаю на кнопку с именем 'ДобавитьИзФайлаНаДиске'
			И я выбираю файл 'C:\1C\Чек.jpg'
			Тогда открылось окно 'Обслуживание клиента * от *'
		* Я сохраняю документ
			И В текущем окне я нажимаю кнопку командного интерфейса 'Основное'
			И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
			И я жду закрытия окна 'Обслуживание клиента * от *' в течение 20 секунд
			Тогда открылось окно 'Обслуживание клиента'	
