
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	ЗаполнитьГрафикОтпусков(Диаграмма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикОтпусков(Диаграмма)

	ДанныеДокумента = Объект.ОтпускаСотрудников.Выгрузить();
	
	Серия = Диаграмма.УстановитьСерию("Отпуска");
	Для Каждого Строка Из ДанныеДокумента Цикл
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
