#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СозданныеАкты(Параметры) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботы.Клиент КАК Контрагент,
		|	ВКМ_ВыполненныеКлиентуРаботы.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботы.Договор.Организация КАК Организация,
		|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|ГДЕ
		|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_СозданныеАктыУслуг.Регистратор.Дата КАК РегистраторДата,
		|	ВКМ_СозданныеАктыУслуг.Договор КАК Договор,
		|	ВКМ_СозданныеАктыУслуг.Клиент КАК Клиент,
		|	ВКМ_СозданныеАктыУслуг.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_Акты
		|ИЗ
		|	РегистрНакопления.ВКМ_СозданныеАктыУслуг КАК ВКМ_СозданныеАктыУслуг
		|ГДЕ
		|	ВКМ_СозданныеАктыУслуг.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.Контрагент КАК Контрагент,
		|	ВТ_ДанныеДокумента.Договор КАК Договор,
		|	ВТ_ДанныеДокумента.Организация КАК Организация,
		|	ВТ_ДанныеДокумента.Дата КАК Дата,
		|	ЕСТЬNULL(ВТ_Акты.Регистратор, 0) КАК Регистратор
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Акты КАК ВТ_Акты
		|		ПО (ВТ_ДанныеДокумента.Договор = ВТ_Акты.Договор
		|		И ВТ_ДанныеДокумента.Контрагент = ВТ_Акты.Клиент)";
		
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Регистратор = 0 Тогда
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = Выборка.Дата;
			НовыйДокумент.Организация = Выборка.Организация;
			НовыйДокумент.Контрагент = Выборка.Контрагент;
			НовыйДокумент.Договор = Выборка.Договор;
			НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
			НовыйДокумент.Записать();
		
			НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
			НовыйДокумент.ПроверитьЗаполнение();
			НовыйДокумент.Записать();
			
			Запись = Новый Структура;
			Запись.Вставить("Договор", НовыйДокумент.Договор);
			Запись.Вставить("Ссылка", НовыйДокумент.Ссылка);
			Результат.Добавить(Запись);
		
			Если Не НовыйДокумент.ПроверитьЗаполнение() Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Ошибка при записи документа";
				Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
		
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
				
	КонецЦикла;
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли
